from patients.models import Patient
from datetime import date
import random

names = [
    "أحمد خالد", "محمد علي", "سارة حسين", "رنا يوسف", "علي إبراهيم",
    "هاجر محمد", "مروان كريم", "ليلى علي", "نسرين محمود", "فاطمة زيد",
    "حسن جاسم", "ريما عدنان", "نور خالد", "آدم علي", "سعيد عمر",
    "سناء يوسف", "باسل علي", "جميلة سامر", "رائد محمد", "رامي حسين",
    "أمل عبد الله", "ندى خالد", "هبة زيد", "مالك فؤاد", "سمر حاتم",
    "قيس ناصر", "راما نجم", "ضحى أمين", "نزار يوسف", "تميم علي",
    "جنى عدنان", "نورين محمود", "كريم حيدر", "جود خالد", "ياسر عمر",
    "آية محمود", "نوف أحمد", "سلمان عبد الكريم", "ميساء فاضل", "عبد الرحمن هاشم",
    "ريهام كاظم", "حوراء فهد", "ملاك سامي", "دانية أحمد", "معتز يونس",
    "بتول عدنان", "نادر حسن", "حلا علي", "حسن عمر", "إيمان خالد"
]

diagnoses = [
    "نزلة برد", "ألم أسنان", "التهاب لثة", "صداع مزمن", "فحص دوري",
    "ارتفاع ضغط", "آلام في الظهر", "التهاب أذن", "دوخة متكررة", "سعال شديد"
]

for i in range(50):
    name = names[i]
    phone = f"07{random.randint(5,9)}{random.randint(10000000, 99999999)}"
    age = random.randint(18, 70)
    diagnosis = random.choice(diagnoses)

    Patient.objects.create(
        name=name,
        age=age,
        phone=phone,
        diagnosis=diagnosis
    )

print("✅ تمت إضافة 50 مريض تجريبي بنجاح!")
